[
    {
        "id": 1,
        "title": "5 Signs Your Pet Needs Urgent Care",
        "excerpt": "Learn how to spot the subtle warning signs that your furry friend might need immediate veterinary attention.",
        "content": "Our pets can't tell us when something is wrong, so it's up to us to notice the signs. In this guide, Dr. Hamilton breaks down the 5 critical symptoms you should never ignore...\n\n1. Difficulty Breathing: If your pet is panting without exercise or struggling for breath, this is an emergency.\n2. Seizures: Any seizure activity requires immediate vet care.\n3. Sudden Collapse: Even if they recover quickly, this could indicate heart issues.\n4. Vomiting/Diarrhea: If persistent for more than 24 hours or containing blood.\n5. Difficulty Urinating: Especially in male cats, this is life-threatening.\n\nAlways err on the side of caution. If you are unsure, call our 24/7 triage line immediately.",
        "author": "Dr. Richard Hamilton",
        "date": "Oct 12, 2025",
        "image": "https://images.unsplash.com/photo-1576201836106-db1758fd1c97?auto=format&fit=crop&q=80&w=800",
        "category": "Health Health"
    },
    {
        "id": 2,
        "title": "Nutrition 101: The Raw Food Debate",
        "excerpt": "Is a raw diet right for your dog? We explore the benefits, risks, and scientific consensus behind this growing trend.",
        "content": "The raw food diet (BARF) has gained massive popularity, but is it safe? \n\n**The Benefits:**\nProponents argue it leads to shinier coats, healthier skin, and higher energy levels.\n\n**The Risks:**\nBacterial contamination (Salmonella, E. coli) is a real risk for both pets and owners. Nutritional imbalance is also common if not carefully formulated.\n\n**Our Verdict:**\nConsult with a veterinary nutritionist before switching. We offer personalized diet plans that can safely incorporate fresh foods.",
        "author": "Dr. Isabella Rossi",
        "date": "Oct 10, 2025",
        "image": "https://images.unsplash.com/photo-1589924691195-41432c84c161?auto=format&fit=crop&q=80&w=800",
        "category": "Nutrition"
    },
    {
        "id": 3,
        "title": "Puppy Socialization: The Critical Window",
        "excerpt": "Why the first 16 weeks of your puppy's life define their future behavior and how to make the most of it.",
        "content": "Between 3 and 16 weeks of age, your puppy is in their critical socialization period. What they experience now shapes how they view the world forever.\n\n**Checklist:**\n- Meet 100 new people (safely)\n- Walk on different surfaces (grass, concrete, wood)\n- Hear different sounds (traffic, vacuum, doorbell)\n\nDon't wait until they are fully vaccinated to start *safe* socialization. Carry them or use a stroller!",
        "author": "Pawly Team",
        "date": "Oct 08, 2025",
        "image": "https://images.unsplash.com/photo-1548199973-03cce0bbc87b?auto=format&fit=crop&q=80&w=800",
        "category": "Training"
    }
]